import { readFileSync } from 'fs';
import { join } from 'path';

import { parseSoldiers } from './parse-soldiers';

describe('parseSoldiers', () => {
	it('성공', () => {
		const data = readFileSync(join(__dirname, 'test/성공.txt'), 'utf-8');

		expect(parseSoldiers({ data } as any)).toEqual([
			{
				입영부대Code: '20020191700',
				입영부대EduId: '6506',
				군인Code: '6142000',
				입영일: '20210302',
				생년월일: '20010928',
				이름: '김민석',
			},
			{
				입영부대Code: '20121190200',
				입영부대EduId: '6611',
				군인Code: '3051000',
				입영일: '20210329',
				생년월일: '20010822',
				이름: '이예건',
			},
			{
				입영부대Code: '20220280600',
				입영부대EduId: '6629',
				군인Code: '2050000',
				입영일: '20210406',
				생년월일: '20010814',
				이름: '이지원',
			},
			{
				입영부대Code: '20020191700',
				입영부대EduId: '6698',
				군인Code: '6142000',
				입영일: '20210426',
				생년월일: '20010405',
				이름: '김민수',
			},
			{
				입영부대Code: '20220280100',
				입영부대EduId: '12117',
				군인Code: '2031000',
				입영일: '20220125',
				생년월일: '20011020',
				이름: '김명훈',
			},
			{
				입영부대Code: '20020191700',
				입영부대EduId: '14030',
				군인Code: '6142000',
				입영일: '20220214',
				생년월일: '20011126',
				이름: '이상택',
			},
		]);
	});
});
